#include "SYSCFG.h"
#include "FT64F0AX.h"

//===========================================================
// UART1初始化（9600波特率，仅启用发送）
//===========================================================
void UART_INITIAL(void)
{
    // 1. 使能UART1模块时钟
    PCKEN |= 0B00100000;  // PCKEN第5位=1（UART1时钟使能）
    
    UR1IER = 0B00100000;  
    
    // 3. 数据格式：8位数据，1位停止位，无奇偶校验（8N1）
    UR1LCR = 0B00000001;
    
    // 4. 使能UART发送/接收接口
    UR1MCR = 0B00011000;  // 第3位=1（发送使能），第4位=1（接收使能）
    
    // 5. 波特率计算（8MHz→9600：UR1DLL=8e6/(16*9600)≈52）
    UR1DLL = 104;
    UR1DLH = 0;

    
}