// Project: TEST_64F0Ax_TIM1_PWM.prj
// Device:  FT64F0AX
// Memory:  PROM=10Kx14, SRAM=1KB, EEPROM=128                             
// Description: TIM1 CH1互补输出周期为20kHz的方波，占空比40%
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.6        25-6-5        修改系统时钟为8MHz，使能LVR
//
//                FT64F0AX  TSSOP20
//              -------------------
// NC----------|1(PA5)   	(PA4)20|-----------NC     
// NC----------|2(PA6)   	(PA3)19|-----------NC 
// NC----------|3(PA7)   	(PA2)18|-----------NC
// TIM1_CH1N---|4(PC0)   	(PA1)17|-----------NC
// NC----------|5(PC1)		(PA0)16|-----TIM1_CH1	
// NC----------|6(PB7)		(PB0)15|-----------NC
// GND---------|7(GND)		(PB1)14|-----------NC
// NC----------|8(PB6)		(PB2)13|-----------NC
// VDD---------|9(VDD)		(PB3)12|-----------NC
// NC----------|10(PB5)		(PB4)11|-----------NC
//				-------------------
// 
//*********************************************************
#include	"SYSCFG.h"
#include 	"FT64F0AX.h"
//Variable definition
volatile char W_TMP  @ 0x70 ;//系统占用不可以删除和修改
volatile char BSR_TMP  @ 0x71 ;//系统占用不可以删除和修改
void user_isr();//用户中断程序，不可删除
//===========================================================
//Funtion name：interrupt ISR
//parameters：无
//returned value：无
//===========================================================
void interrupt ISR(void)
{
#asm;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
	NOP;//系统设置不可以删除和修改
#endasm;//系统设置不可以删除和修改
	user_isr(); //调用用户中断函数
}
void user_isr() //调用用户中断函数
{
}
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01100001;			//系统时钟选择为内部振荡器8MHz,分频比为1:1
    
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;
    
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00000000;
	WPUC=0B00000000;	
	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;
	
	TRISA=0B00000000;			//输入输出设置，0-输出，1-输入,TIM1_CH1,PA0-输出
	TRISB=0B00000000;				
	TRISC=0B00000000;			//TIM1_CH1N,PC0-输出
	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;
	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;
	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
 /*-------------------------------------------------
 * 函数名：TIM1_INITIAL
 * 功能：  初始化TIM1（20kHz，40%占空比）
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void TIM1_INITIAL(void)
 {
    PCKEN|=0B00000010;			//使能TIMER1模块时钟
    CKOCON=0B00100000;			//Timer1倍频时钟占空比调节位4ns延迟
    TCKSRC=0B00000011;			//Timer1时钟源为HIRC的2倍频（16MHz）
    
    TIM1CR1=0B10000101;			//允许自动装载，使能计数器
    TIM1CR2=0B00000000;
    
    TIM1SMCR=0B00000000;
    TIM1ETR=0B00000000;
    TIM1IER=0B00000000;			//禁止所有中断
    
    TIM1SR1=0B00000000;
    TIM1SR2=0B00000000;
    
    TIM1EGR=0B00000000;
    
    TIM1CCMR1=0B01101000;		//将通道1配置为输出，PWM模式1，开启TIM1CCR1H/L预装载功能
    TIM1CCMR2=0B00000000;
    TIM1CCMR3=0B00000000;
    TIM1CCMR4=0B00000000;
    
    TIM1CCER1=0B00001111;		//通道1使能输出及互补输出，低电平有效
    TIM1CCER2=0B00000000;
    
	TIM1CNTRH=0B00000000;
    TIM1CNTRL=0B00000000;
    
    TIM1ARRH=0x06;				//自动装载高8位      
    TIM1ARRL=0x3F;				//自动装载低8位 0x063F=1599（kHz） 用来算ARR. 频率= TIM1时钟=16Mhz / [(ARR+1)×(RCR+1)]
    
    TIM1PSCRH=0B00000000;		//不分频
    TIM1PSCRL=0B00000000;		//不分频
    
    TIM1RCR=0B00001111;			//重复计数器值=15（保持不变）
    
    TIM1CCR1H=0X02;				//PWM脉宽高8位
    TIM1CCR1L=0X80;				//PWM脉宽低8位 用来算CCR
    
    TIM1BKR=0B11000000;			//使能输出和互补输出，禁止刹车输入
    
    TIM1DTR=0B00000111;			//死区发生器设置，218.75ns（保持不变）
    
    TIM1OISR=0B00000000;		//空闲状态输出设置
    
    LEBCON=0B00000000;			//禁止前沿消隐
	//占空比=CCR1/(AAR+1)
 }
/*-------------------------------------------------
 * 函数名：main
 * 功能：  主函数 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();			//系统初始化
    TIM1_INITIAL();
  
    while(1)
    {
        NOP();
    }
}